articles.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-09-07 Tue 00:09 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Articles</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Ashok Khanna">
 <meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="preamble" class="status">
<div id="quote">Ashok Khanna</div>
<div id="home-link"><a href="/index.html">Home</a></div>
<div id="articles-link"><a href="/articles.html">Articles</a></div>
<div id="resources-link"><a href="/resources.html">Resources</a></div>
</div>
<div id="content">
<h1 class="title">Articles</h1>
<p>
Below is a listing of articles I have written to date, sorted by
topic and then chronologically. Some of these are hosted on Medium,
and I am in the (albeit slow) process of porting them over to my
main website here.
</p>

<p>
I hope you find them useful, and <a href="mailto:email@ashok.jp">drop me an e-mail</a> to discuss any of
the below in greater depth.
</p>


<div id="outline-container-org180b079" class="outline-2">
<h2 id="org180b079">Emacs</h2>
<div class="outline-text-2" id="text-org180b079">
<ol class="org-ol">
<li><a href="https://ashok-khanna.medium.com/introduction-to-dired-mode-91cecd3a06ff">Introduction to Dired Mode</a> (August 23, 2021)</li>
</ol>
</div>
</div>


<div id="outline-container-org21ac2a2" class="outline-2">
<h2 id="org21ac2a2">Common Lisp</h2>
<div class="outline-text-2" id="text-org21ac2a2">
<ol class="org-ol">
<li><a href="https://ashok-khanna.medium.com/continuations-in-common-lisp-1911cb413a03">Continuations in Common Lisp</a> (August 17, 2021)</li>

<li><a href="https://ashok-khanna.medium.com/introduction-to-asdf-d25efe2780c2">Introduction to ASDF</a> (August 13, 2021)</li>

<li><a href="https://ashok-khanna.medium.com/persistent-in-memory-data-storage-in-common-lisp-b-k-n-r-37f8ae76042f">Persistent in Memory Data Storage in Common Lisp</a> (June 23, 2021)</li>

<li><a href="https://ashok-khanna.medium.com/lisp-the-web-4c00c88d11f9">Lisp &amp; the Web</a> (April 16, 2021)</li>

<li><a href="https://ashok-khanna.medium.com/an-introduction-to-lisp-packages-7a9ee352006e">Introduction to Lisp Packages</a> (December 29, 2020)</li>

<li><a href="https://ashok-khanna.medium.com/common-lisp-entering-the-matrix-9f4d90145a50">Common Lisp - Entering the Matrix</a> (December 8, 2020)</li>

<li><a href="https://ashok-khanna.medium.com/formatting-lisp-5e28020b8bac">Formatting Lisp</a> (October 26, 2020)</li>
</ol>
</div>
</div>


<div id="outline-container-orgffbf439" class="outline-2">
<h2 id="orgffbf439">Web Development</h2>
<div class="outline-text-2" id="text-orgffbf439">
<ol class="org-ol">
<li><a href="https://ashok-khanna.medium.com/rounded-tables-an-elusive-dream-5f00709f6521">Rounded Tables: An Elusive Dream</a> (May 24, 2021)</li>

<li><a href="https://ashok-khanna.medium.com/lisp-the-web-4c00c88d11f9">Lisp &amp; the Web</a> (April 16, 2021)</li>

<li><a href="https://ashok-khanna.medium.com/beautiful-pdfs-from-html-9a7a3c565404">Beautiful PDFs from HTML</a> (April 9, 2021)</li>

<li><a href="https://ashok-khanna.medium.com/crud-webapp-with-angular-node-js-mysql-5733fd1b8fc4">CRUD Web App with Angular, Node.Js and MySQL</a> (July 18, 2020)</li>
</ol>
</div>
</div>


<div id="outline-container-orgbd824c6" class="outline-2">
<h2 id="orgbd824c6">Macrology</h2>
<div class="outline-text-2" id="text-orgbd824c6">
<ol class="org-ol">
<li><a href="articles/macrology/with.html">The With Macro</a> (September 6, 2021)</li>
</ol>
</div>
</div>

<div id="outline-container-org4f870f2" class="outline-2">
<h2 id="org4f870f2">Other</h2>
<div class="outline-text-2" id="text-org4f870f2">
<p>
In the future, I will add some other articles here.
</p>
</div>
</div>
</div>
</body>
</html>
